---
kind: method
id: M:Autodesk.Revit.UI.PromptForFamilyInstancePlacementOptions.Dispose
source: html/f725896f-03e1-44a4-e68d-9c845f700883.htm
---
# Autodesk.Revit.UI.PromptForFamilyInstancePlacementOptions.Dispose Method

Releases all resources used by the PromptForFamilyInstancePlacementOptions

## Syntax (C#)
```csharp
public void Dispose()
```